In [2]:
#importar librerias
import numpy as np
import pandas as pd
from pandas import read_csv
import matplotlib.pyplot as plt
%matplotlib inline

In [3]:
#cargar dataset
filename = 'music.csv'
data= read_csv(filename)
data

    age  gender            genre
0    20       1       Rap y Rock
1    23       1       Rap y Rock
2    25       1       Rap y Rock
3    26       1        Reggaeton
4    29       1        Reggaeton
5    30       1        Reggaeton
6    31       1        Reggaeton
7    33       1       Rock y pop
8    37       1       Rock y pop
9    40       1       Rock y pop
10   20       0             Kpop
11   21       0             Kpop
12   25       0             Kpop
13   27       0        Reggaeton
14   30       0        Reggaeton
15   31       0        Reggaeton
16   34       0  Cumbias y banda
17   35       0  Cumbias y banda
18   40       0  Cumbias y banda

In [4]:
#especificar el tipo de datos que tenemos
data.dtypes

age        int64
gender     int64
genre     object
dtype: object

In [5]:
#el tama√±o del dataset(numero de datos,columnas)
data.shape

(19, 3)

In [6]:
#manejo de datos duplicados
data.duplicated().sum()

0

In [7]:
#manejo de valores perdidos
data.isnull().sum()

age       0
gender    0
genre     0
dtype: int64

In [8]:
data.genre.unique()

array(['Rap y Rock', 'Reggaeton', 'Rock y pop', 'Kpop', 'Cumbias y banda'],
      dtype=object)

In [9]:
#conversion de datos en numeros
data.genre.replace({'Rap y Rock':0, 'Reggaeton':1, 'Rock y pop':2, 'Kpop':3, 'Cumbias y banda':4}, inplace=True)

In [10]:
data.head(10)

   age  gender  genre
0   20       1      0
1   23       1      0
2   25       1      0
3   26       1      1
4   29       1      1
5   30       1      1
6   31       1      1
7   33       1      2
8   37       1      2
9   40       1      2

In [11]:
data.dtypes

age       int64
gender    int64
genre     int64
dtype: object

In [12]:
#definicion de variables
df_x = data[['age','gender']] #para edades y genero
df_y = data[['genre']]#para genero de musica

In [13]:
df_x.head(5)

   age  gender
0   20       1
1   23       1
2   25       1
3   26       1
4   29       1

In [14]:
df_y.head(5)

   genre
0      0
1      0
2      0
3      1
4      1

In [15]:
#librerias para seleccion de modelos
from sklearn.model_selection import train_test_split
from sklearn.model_selection import cross_val_score
from sklearn.metrics import confusion_matrix
from sklearn import metrics

X_train, X_test, y_train, y_test = train_test_split(df_x, df_y, test_size=0.3, random_state=42)#definicion variable de variables de prueba y entrenamiento

In [16]:
X_train.head()

    age  gender
3    26       1
13   27       0
15   31       0
17   35       0
2    25       1

In [17]:
X_test.head()

    age  gender
0    20       1
5    30       1
11   21       0
1    23       1
8    37       1

In [18]:
y_train.head()

    genre
3       1
13      1
15      1
17      4
2       0

In [19]:
y_test.head()

    genre
0       0
5       1
11      3
1       0
8       2

In [20]:
#ajustar el modelo
from sklearn.tree import DecisionTreeClassifier
clf = DecisionTreeClassifier()
clf.fit(X_train,y_train)
print("")
print("Abajo es la puntuacion del modelo")
clf.score(X_test,y_test)

Abajo es la puntuacion del modelo

1.0

In [21]:
#validacion de cruz
from sklearn.model_selection import cross_val_score
v = cross_val_score(clf, X_train, y_train, cv=3)
for i in range(3):
    print("La certeza del arbol de decision es: {0:2%}".format(v[i,]))
print("La certeza promedio del arbol de decision es:",v.mean())

La certeza del arbol de decision es: 60.000000%
La certeza del arbol de decision es: 75.000000%
La certeza del arbol de decision es: 75.000000%
La certeza promedio del arbol de decision es: 0.7000000000000001

C:\anaconda\envs\Cuz\lib\site-packages\sklearn\model_selection\_split.py:667: UserWarning: The least populated class in y has only 1 members, which is less than n_splits=3.
  % (min_groups, self.n_splits)), UserWarning)

In [23]:
#arrojar el modelo
import joblib as joblib
joblib.dump(clf,('modelos/tree.pkl'))
print("Modelo arrojado al disco")
modelo = joblib.load('modelos/tree.pkl')
print("El modelo esta cargado desde el disco")

Modelo arrojado al disco
El modelo esta cargado desde el disco

In [26]:
#prueba y hacer predicciones
resultados = modelo.predict([[22,0]])
print(resultados[0])

3